# MODULES

In [1]:
import os
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

# DATA EXPLORATION & CLEANING

In [2]:
os.listdir()

['.ipynb_checkpoints',
 '10 ALYTICS GLOBAL HACKATHON.ipynb',
 '10 ALYTICS GLOBAL HACKATHON.zip',
 'Datasets',
 'final.csv',
 'PowerbiFile - Copy.pbix',
 'PowerbiFile.pbix',
 'PowerbiFile.pdf',
 'PowerbiFile_.pdf']

In [3]:
os.listdir("Datasets")

['1. unemployment-rate-men-vs-women.csv',
 '2. national-strategy-for-youth-employment.csv',
 '3. share-of-education-in-government-expenditure.csv',
 '4. share-of-the-population-with-access-to-electricity.csv',
 '5. Total_firms_Historical_data.xlsx',
 '6. Country Codes.csv',
 'Day 1 - 10Alytics Global Data Hackathon 2023 (introduction).pdf',
 'December 2023 Global Hackathon - Unemployment.pdf',
 'December 2023 Global Hackathon - Unemployment.pptx']

## 1. Unemployment Data Exploration

In [4]:
unemployment = pd.read_csv(r"D:\ZINDI\10 Alytics Data Analytic 2023\Datasets\1. unemployment-rate-men-vs-women.csv")

# rename columns
unemployment.columns=['Country', 'Iso_Code_3', 'Year','Females','Males',"Population",'Continent']

#only consider the rows where the estimated valeus for females and males are provided
unemployment=unemployment[(unemployment["Females"]>0) & (unemployment["Males"]>0)]

unemployment.sort_values(by=["Country","Year"],inplace=True)
print(unemployment.shape)
unemployment.head(3)

(6231, 7)

       Country Iso_Code_3  Year  Females   Males  Population Continent
1  Afghanistan        AFG  1991   13.615  10.089  10745168.0       NaN
2  Afghanistan        AFG  1992   13.816  10.258  12057436.0       NaN
3  Afghanistan        AFG  1993   13.712  10.165  14003764.0       NaN

In [5]:
unemployment.isna().sum()

Country          0
Iso_Code_3     403
Year             0
Females          0
Males            0
Population     279
Continent     6044
dtype: int64

In [6]:
unemployment.drop(columns=['Continent'],inplace=True)

In [7]:
unemployment.dropna(subset=['Iso_Code_3'], inplace=True)

## 2. Strategy Data Exploration

In [8]:
strategy = pd.read_csv(r"D:\ZINDI\10 Alytics Data Analytic 2023\Datasets\2. national-strategy-for-youth-employment.csv")
strategy.columns=['Country', 'Iso_Code_3', 'Year','Strategy Existence']
strategy.sort_values(by=["Country","Year"],inplace=True)
print(strategy.shape)
strategy.head(3)

(363, 4)

       Country Iso_Code_3  Year     Strategy Existence
0  Afghanistan        AFG  2019  Developing a Strategy
1  Afghanistan        AFG  2020  Developing a Strategy
2    Argentina        ARG  2019            No Strategy

In [9]:
strategy.isna().sum()

Country               0
Iso_Code_3            0
Year                  0
Strategy Existence    0
dtype: int64

## 3. Expenditure Data Exploration

In [10]:
expenditure= pd.read_csv(r"D:\ZINDI\10 Alytics Data Analytic 2023\Datasets\3. share-of-education-in-government-expenditure.csv")
expenditure.columns=['Country', 'Iso_Code_3', 'Year','Edu Expenditure Perc']
expenditure.sort_values(by=["Country","Year"],inplace=True)
print(expenditure.shape)
expenditure.head(3)

(4104, 4)

       Country Iso_Code_3  Year  Edu Expenditure Perc
0  Afghanistan        AFG  2005                 15.08
1  Afghanistan        AFG  2006                 12.88
2  Afghanistan        AFG  2007                 12.36

In [11]:
expenditure.isna().sum()

Country                   0
Iso_Code_3              295
Year                      0
Edu Expenditure Perc      0
dtype: int64

In [12]:
expenditure.dropna(subset=['Iso_Code_3'], inplace=True)

## 4. Electricity Data Exploration

In [13]:
electricity= pd.read_csv(r"D:\ZINDI\10 Alytics Data Analytic 2023\Datasets\4. share-of-the-population-with-access-to-electricity.csv")
electricity.columns=['Country', 'Iso_Code_3', 'Year','Electricity Access Perc']
electricity.sort_values(by=["Country","Year"],inplace=True)
print(electricity.shape)
electricity.head(3)

(6233, 4)

       Country Iso_Code_3  Year  Electricity Access Perc
0  Afghanistan        AFG  2000                 1.613591
1  Afghanistan        AFG  2001                 4.074574
2  Afghanistan        AFG  2002                 9.409158

In [14]:
electricity.isna().sum()

Country                      0
Iso_Code_3                 370
Year                         0
Electricity Access Perc      0
dtype: int64

In [15]:
electricity.dropna(subset=['Iso_Code_3'], inplace=True)

## 5. Firms Data Exploration

In [16]:
firms= pd.read_excel(r"D:\ZINDI\10 Alytics Data Analytic 2023\Datasets\5. Total_firms_Historical_data.xlsx")
firms.columns=['Country', 'Adult Population', 'Year','LLC Count','LLC Density']
firms.sort_values(by=["Country","Year"],inplace=True)
firms=firms.iloc[3:]
print(firms.shape)
firms.head(3)

(1523, 5)

       Country  Adult Population    Year  LLC Count  LLC Density
0  Afghanistan        14039528.0  2009.0     4289.0     0.305495
1  Afghanistan        14444996.0  2010.0     9048.0     0.626376
2  Afghanistan        15041824.0  2011.0    12793.0     0.850495

In [17]:
firms.isna().sum()

Country             1
Adult Population    1
Year                1
LLC Count           1
LLC Density         1
dtype: int64

In [18]:
firms[pd.isna(firms['Country'])]

     Country  Adult Population  Year  LLC Count  LLC Density
1522     NaN               NaN   NaN        NaN          NaN

In [19]:
firms.dropna(inplace=True)

In [20]:
firms["Year"]=firms["Year"].apply(lambda x: int(x))

In [21]:
# Remove stars (asterisks) from countries with two or three stars
firms['Country'] = firms['Country'].str.replace(r'\*{2,3}$', '', regex=True)

# Create a new column "Eurostat_Center" based on the presence of one star
firms['Eurostat Center'] = firms['Country'].str.contains(r'\*$').map({True: 'Yes', False: 'No'})

# Remove the star in the original "Country" column
firms['Country'] = firms['Country'].str.replace(r'\*$', '', regex=True)

In [22]:
firms.loc[firms["Country"]=="Netherlands Antilles","Country"]="Netherlands"
firms.loc[firms["Country"]=="Hong Kong SAR","Country"]="Hong Kong"
firms.loc[firms["Country"]=="Hong Kong SAR, China","Country"]="Hong Kong"
firms.loc[firms["Country"]=="Egypt, Arab Rep.","Country"]="Egypt" 
firms.loc[firms["Country"]=="Iran, Islamic Rep.","Country"]="Iran" 
firms.loc[firms["Country"]=='Brazil ',"Country"]="Brazil" 
firms.loc[firms["Country"]=='Taiwan, China',"Country"]="Taiwan, Province of China" 
firms.loc[firms['Country'].str.contains('Taiwan'),"Country"]="Taiwan"
firms.loc[firms['Country'].str.contains('Congo,'),'Country']='Congo_Demo'
firms.loc[firms['Country'].str.contains('Korea,'),'Country']='Korea_Democratic'
firms.loc[firms['Country'].str.contains('Slovak'),'Country']='Slovakia'
firms.loc[firms["Country"]=='Kyrgyz Republic',"Country"]="Kyrgyzstan"

## 6. Countries Data Exploration

In [23]:
countries= pd.read_csv(r"D:\ZINDI\10 Alytics Data Analytic 2023\Datasets\6. Country Codes.csv")
countries.columns=['Country', 'Iso_Code_2', 'Iso_Code_3','Country Code','Region','Sub Region']
countries.head(3)

         Country Iso_Code_2 Iso_Code_3  Country Code  Region       Sub Region
0    Afghanistan         AF        AFG             4    Asia    Southern Asia
1  Åland Islands         AX        ALA           248  Europe  Northern Europe
2        Albania         AL        ALB             8  Europe  Southern Europe

In [24]:
countries.isna().sum()

Country         0
Iso_Code_2      1
Iso_Code_3      0
Country Code    0
Region          1
Sub Region      1
dtype: int64

In [25]:
countries[pd.isna(countries["Region"])]

      Country Iso_Code_2 Iso_Code_3  Country Code Region Sub Region
8  Antarctica         AQ        ATA            10    NaN        NaN

In [26]:
countries.Region.unique()

array(['Asia', 'Europe', 'Africa', 'Oceania', 'Americas', nan],
      dtype=object)

In [27]:
countries["Region"].fillna("Antarctica",inplace=True)
countries["Sub Region"].fillna("Antarctica",inplace=True)

In [28]:
countries[pd.isna(countries["Iso_Code_2"])]

     Country Iso_Code_2 Iso_Code_3  Country Code  Region          Sub Region
153  Namibia        NaN        NAM           516  Africa  Sub-Saharan Africa

In [29]:
countries["Iso_Code_2"].fillna("NA",inplace=True)

In [30]:
countries.loc[countries["Country"]=="Czechia","Country"]="Czech Republic"
countries.loc[countries["Country"]=="Iran (Islamic Republic of)","Country"]="Iran"
countries.loc[countries['Country'].str.contains('Taiwan'),"Country"]="Taiwan"
countries.loc[countries['Country'].str.contains('Congo,'),'Country']='Congo_Demo'
countries.loc[countries['Country'].str.contains('Korea, Republic of'),'Country']='Korea_Republic'
countries.loc[countries["Iso_Code_3"]=="PRK","Country"]="Korea_Democratic"
countries.loc[countries['Country'].str.contains('United Kingdom'),'Country']='United Kingdom'
countries.loc[countries['Country'].str.contains('Bolivia'),'Country']='Bolivia'

In [31]:
# Remove comma and everything after it for long country names
countries['Country'] = countries['Country'].str.replace(r',.*$', '', regex=True)

# Merge the Datasets

In [32]:
# Column to check
column_to_check = 'Iso_Code_3'

# Get values in df1's column that are not present in df2's column
values_not_in_unemployment = unemployment[~unemployment[column_to_check].isin(countries[column_to_check])][column_to_check]

print("Values in unemployment's column not present in countries's column:")
print(values_not_in_unemployment.unique())

Values in unemployment's column not present in countries's column:
['OWID_CIS' 'OWID_WRL']

In [33]:
# Get values in strategy's column that are not present in countries's column
values_not_in_strategy = strategy[~strategy[column_to_check].isin(countries[column_to_check])][column_to_check]

print("Values in strategy's column not present in countries's column:")
print(values_not_in_strategy.unique())

Values in strategy's column not present in countries's column:
[]

In [34]:
# Get values in expenditure's column that are not present in countries's column
values_not_in_expenditure = expenditure[~expenditure[column_to_check].isin(countries[column_to_check])][column_to_check]

print("Values in expenditure's column not present in countries's column:")
print(values_not_in_expenditure.unique())

Values in expenditure's column not present in countries's column:
['OWID_WRL']

In [35]:
# Get values in electricity's column that are not present in countries's column
values_not_in_electricity = electricity[~electricity[column_to_check].isin(countries[column_to_check])][column_to_check]

print("Values in electricity's column not present in countries's column:")
print(values_not_in_electricity.unique())

Values in electricity's column not present in countries's column:
['OWID_CIS' 'OWID_KOS' 'OWID_WRL']

In [36]:
# Column to check
column_to_check2 = 'Country'

# Get values in electricity's column that are not present in countries's column
values_not_in_firms= firms[~firms[column_to_check2].isin(countries[column_to_check2])][column_to_check2]

print("Values in firms's column not present in countries's column:")
print(values_not_in_firms.unique())

Values in firms's column not present in countries's column:
['Kosovo']

In [37]:
display(unemployment.head(1),
       strategy.head(1))

       Country Iso_Code_3  Year  Females   Males  Population
1  Afghanistan        AFG  1991   13.615  10.089  10745168.0

       Country Iso_Code_3  Year     Strategy Existence
0  Afghanistan        AFG  2019  Developing a Strategy

In [38]:
strategy.drop('Country',axis=1,inplace=True)
final1=unemployment.merge(strategy,on=["Iso_Code_3","Year"],how='left')
final1.head()

,Country,Iso_Code_3,Year,Females,Males,Population,Strategy Existence
0,Afghanistan,AFG,1991,13.615,10.089,10745168.0,NaN
1,Afghanistan,AFG,1992,13.816,10.258,12057436.0,NaN
2,Afghanistan,AFG,1993,13.712,10.165,14003764.0,NaN
3,Afghanistan,AFG,1994,13.722,10.170,15455560.0,NaN
4,Afghanistan,AFG,1995,14.235,10.610,16418911.0,NaN

In [39]:
display(final1.head(1),
       expenditure.head(1))

,Country,Iso_Code_3,Year,Females,Males,Population,Strategy Existence
0,Afghanistan,AFG,1991,13.615,10.089,10745168.0,NaN

       Country Iso_Code_3  Year  Edu Expenditure Perc
0  Afghanistan        AFG  2005                 15.08

In [40]:
expenditure.drop('Country',axis=1,inplace=True)
final2=final1.merge(expenditure,on=["Iso_Code_3","Year"],how='left')
final2.head()

,Country,Iso_Code_3,Year,Females,Males,Population,Strategy Existence,Edu Expenditure Perc
0,Afghanistan,AFG,1991,13.615,10.089,10745168.0,NaN,NaN
1,Afghanistan,AFG,1992,13.816,10.258,12057436.0,NaN,NaN
2,Afghanistan,AFG,1993,13.712,10.165,14003764.0,NaN,NaN
3,Afghanistan,AFG,1994,13.722,10.170,15455560.0,NaN,NaN
4,Afghanistan,AFG,1995,14.235,10.610,16418911.0,NaN,NaN

In [41]:
display(final2.head(1),
       electricity.head(1))

,Country,Iso_Code_3,Year,Females,Males,Population,Strategy Existence,Edu Expenditure Perc
0,Afghanistan,AFG,1991,13.615,10.089,10745168.0,NaN,NaN

       Country Iso_Code_3  Year  Electricity Access Perc
0  Afghanistan        AFG  2000                 1.613591

In [42]:
electricity.drop('Country',axis=1,inplace=True)
final3=final2.merge(electricity,on=["Iso_Code_3","Year"],how='left')
final3.head()

,Country,Iso_Code_3,Year,Females,Males,Population,Strategy Existence,Edu Expenditure Perc,Electricity Access Perc
0,Afghanistan,AFG,1991,13.615,10.089,10745168.0,NaN,NaN,NaN
1,Afghanistan,AFG,1992,13.816,10.258,12057436.0,NaN,NaN,NaN
2,Afghanistan,AFG,1993,13.712,10.165,14003764.0,NaN,NaN,NaN
3,Afghanistan,AFG,1994,13.722,10.170,15455560.0,NaN,NaN,NaN
4,Afghanistan,AFG,1995,14.235,10.610,16418911.0,NaN,NaN,NaN

In [43]:
display(final3.head(1),
       firms.head(1))

,Country,Iso_Code_3,Year,Females,Males,Population,Strategy Existence,Edu Expenditure Perc,Electricity Access Perc
0,Afghanistan,AFG,1991,13.615,10.089,10745168.0,NaN,NaN,NaN

       Country  Adult Population  Year  LLC Count  LLC Density Eurostat Center
0  Afghanistan        14039528.0  2009     4289.0     0.305495              No

In [44]:
#firms.drop('Country',axis=1,inplace=True)
final4=final3.merge(firms,on=["Country","Year"],how='left')
final4.head()

,Country,Iso_Code_3,Year,Females,Males,Population,Strategy Existence,Edu Expenditure Perc,Electricity Access Perc,Adult Population,LLC Count,LLC Density,Eurostat Center
0,Afghanistan,AFG,1991,13.615,10.089,10745168.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,Afghanistan,AFG,1992,13.816,10.258,12057436.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,Afghanistan,AFG,1993,13.712,10.165,14003764.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,Afghanistan,AFG,1994,13.722,10.170,15455560.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,Afghanistan,AFG,1995,14.235,10.610,16418911.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [45]:
display(final4.head(1),
       countries.head(1))

,Country,Iso_Code_3,Year,Females,Males,Population,Strategy Existence,Edu Expenditure Perc,Electricity Access Perc,Adult Population,LLC Count,LLC Density,Eurostat Center
0,Afghanistan,AFG,1991,13.615,10.089,10745168.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN

       Country Iso_Code_2 Iso_Code_3  Country Code Region     Sub Region
0  Afghanistan         AF        AFG             4   Asia  Southern Asia

In [46]:
final4.drop('Country',axis=1,inplace=True)
final=final4.merge(countries,on=["Iso_Code_3"],how='left')
print(final.shape)
final.head()

(5828, 17)

,Iso_Code_3,Year,Females,Males,Population,Strategy Existence,Edu Expenditure Perc,Electricity Access Perc,Adult Population,LLC Count,LLC Density,Eurostat Center,Country,Iso_Code_2,Country Code,Region,Sub Region
0,AFG,1991,13.615,10.089,10745168.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Afghanistan,AF,4.0,Asia,Southern Asia
1,AFG,1992,13.816,10.258,12057436.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Afghanistan,AF,4.0,Asia,Southern Asia
2,AFG,1993,13.712,10.165,14003764.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Afghanistan,AF,4.0,Asia,Southern Asia
3,AFG,1994,13.722,10.170,15455560.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Afghanistan,AF,4.0,Asia,Southern Asia
4,AFG,1995,14.235,10.610,16418911.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Afghanistan,AF,4.0,Asia,Southern Asia

In [47]:
final.isna().sum()

Iso_Code_3                    0
Year                          0
Females                       0
Males                         0
Population                   31
Strategy Existence         5550
Edu Expenditure Perc       2478
Electricity Access Perc     837
Adult Population           4453
LLC Count                  4453
LLC Density                4453
Eurostat Center            4453
Country                      62
Iso_Code_2                   62
Country Code                 62
Region                       62
Sub Region                   62
dtype: int64

In [48]:
# drop world metrics to be left with only Country
final.dropna(subset=['Country'],inplace=True)

In [49]:
#Assuming blanks in Strategy_Exst to mean no strategy we impute
#final['Strategy_Exst']=final['Strategy_Exst'].fillna(0)
final.isna().sum()

Iso_Code_3                    0
Year                          0
Females                       0
Males                         0
Population                    0
Strategy Existence         5488
Edu Expenditure Perc       2437
Electricity Access Perc     828
Adult Population           4391
LLC Count                  4391
LLC Density                4391
Eurostat Center            4391
Country                       0
Iso_Code_2                    0
Country Code                  0
Region                        0
Sub Region                    0
dtype: int64

In [50]:
final.sort_values(by=['Country','Year'],inplace=True)
final.to_csv('final.csv',index=False)

In [51]:
#!pip install pandas-profiling
#!pip install --upgrade pandas pandas-profiling
#!pip install ydata_profiling 
#from pandas_profiling import ProfileReport
"""# Create a ProfileReport
profile = ProfileReport(final, title='Pandas Profiling Report', explorative=True)

# Save the report to an HTML file (optional)
profile.to_file("output_report.html")"""

'# Create a ProfileReport\nprofile = ProfileReport(final, title=\'Pandas Profiling Report\', explorative=True)\n\n# Save the report to an HTML file (optional)\nprofile.to_file("output_report.html")'